#+TITLE: Uni

General structure of project.

The directories in this level point to subjects ordered by semester.

The docs/ folder exists to make use of GitHub Pages.

* If you want to know something

  Visit the file that is named the same as the folder, the READMEs are for export purposes.

* Each folder will contain at least:
  1. one org file named the same as the folder (the actual readme)
  This is the file that you use to include other files.
  2. one README.org file
  This is to generate README files in different formats like .md and the like.
  3. the actual generated README file(s) from the README.org file

  All this just because GitHub automatically displays your README file in your repo page. This naming convention takes advantage of that automation.

* See the project at:
  https://ma-nu-el.github.io/uni/
* Test

#+begin_src R :session :results output
# cargar libreria
library(scales)
# definir variables
# opcion 1
anio_academico<-180000*10
enero_febrero<-140000*2
opcion1<-anio_academico+enero_febrero
# opcion 2
anio_academico<-180000*10
enero_febrero<-120000*2
opcion2<-anio_academico+enero_febrero
diferencia<-opcion1-opcion2
# calcular total
## total<-opcion1
print("diferencia")
dollar(diferencia) # formateado lindo
# imprimir en pantalla
print("total a pagar")
dollar(total) # formateado lindo
## total # crudo
#+end_src

#+RESULTS:
: [1] "diferencia"
: [1] "$40,000"
: [1] "total a pagar"
: [1] "$2,040,000"
